{
    "convertedBy": "TensorFlow.js Converter v3.9.0",
    "format": "layers-model",
    "generatedBy": "keras v2.4.0",
    "modelTopology": {
        "backend": "tensorflow",
        "keras_version": "2.4.0",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                100,
                                100,
                                1
                            ],
                            "dtype": "float32",
                            "name": "conv2d_input",
                            "ragged": false,
                            "sparse": false
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "activation": "relu",
                            "activity_regularizer": null,
                            "batch_input_shape": [
                                null,
                                100,
                                100,
                                1
                            ],
                            "bias_constraint": null,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_regularizer": null,
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "dtype": "float32",
                            "filters": 32,
                            "groups": 1,
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "kernel_regularizer": null,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "name": "conv2d",
                            "padding": "valid",
                            "strides": [
                                1,
                                1
                            ],
                            "trainable": true,
                            "use_bias": true
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "data_format": "channels_last",
                            "dtype": "float32",
                            "name": "max_pooling2d",
                            "padding": "valid",
                            "pool_size": [
                                2,
                                2
                            ],
                            "strides": [
                                2,
                                2
                            ],
                            "trainable": true
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "activation": "relu",
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_regularizer": null,
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "dtype": "float32",
                            "filters": 64,
                            "groups": 1,
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "kernel_regularizer": null,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "name": "conv2d_1",
                            "padding": "valid",
                            "strides": [
                                1,
                                1
                            ],
                            "trainable": true,
                            "use_bias": true
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "data_format": "channels_last",
                            "dtype": "float32",
                            "name": "max_pooling2d_1",
                            "padding": "valid",
                            "pool_size": [
                                2,
                                2
                            ],
                            "strides": [
                                2,
                                2
                            ],
                            "trainable": true
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "activation": "relu",
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_regularizer": null,
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "dtype": "float32",
                            "filters": 128,
                            "groups": 1,
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "kernel_regularizer": null,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "name": "conv2d_2",
                            "padding": "valid",
                            "strides": [
                                1,
                                1
                            ],
                            "trainable": true,
                            "use_bias": true
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "data_format": "channels_last",
                            "dtype": "float32",
                            "name": "max_pooling2d_2",
                            "padding": "valid",
                            "pool_size": [
                                2,
                                2
                            ],
                            "strides": [
                                2,
                                2
                            ],
                            "trainable": true
                        }
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "data_format": "channels_last",
                            "dtype": "float32",
                            "name": "flatten_1",
                            "trainable": true
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "activation": "relu",
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_regularizer": null,
                            "dtype": "float32",
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "kernel_regularizer": null,
                            "name": "dense_3",
                            "trainable": true,
                            "units": 100,
                            "use_bias": true
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "activation": "sigmoid",
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_regularizer": null,
                            "dtype": "float32",
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "kernel_regularizer": null,
                            "name": "dense_4",
                            "trainable": true,
                            "units": 1,
                            "use_bias": true
                        }
                    }
                ],
                "name": "sequential_1"
            }
        },
        "training_config": {
            "loss": "binary_crossentropy",
            "loss_weights": null,
            "metrics": [
                "accuracy"
            ],
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "amsgrad": false,
                    "beta_1": 0.8999999761581421,
                    "beta_2": 0.9990000128746033,
                    "decay": 0.0,
                    "epsilon": 1e-07,
                    "learning_rate": 0.0010000000474974513,
                    "name": "Adam"
                }
            },
            "weighted_metrics": null
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of2.bin",
                "group1-shard2of2.bin"
            ],
            "weights": [
                {
                    "dtype": "float32",
                    "name": "conv2d/kernel",
                    "shape": [
                        3,
                        3,
                        1,
                        32
                    ]
                },
                {
                    "dtype": "float32",
                    "name": "conv2d/bias",
                    "shape": [
                        32
                    ]
                },
                {
                    "dtype": "float32",
                    "name": "conv2d_1/kernel",
                    "shape": [
                        3,
                        3,
                        32,
                        64
                    ]
                },
                {
                    "dtype": "float32",
                    "name": "conv2d_1/bias",
                    "shape": [
                        64
                    ]
                },
                {
                    "dtype": "float32",
                    "name": "conv2d_2/kernel",
                    "shape": [
                        3,
                        3,
                        64,
                        128
                    ]
                },
                {
                    "dtype": "float32",
                    "name": "conv2d_2/bias",
                    "shape": [
                        128
                    ]
                },
                {
                    "dtype": "float32",
                    "name": "dense_3/kernel",
                    "shape": [
                        12800,
                        100
                    ]
                },
                {
                    "dtype": "float32",
                    "name": "dense_3/bias",
                    "shape": [
                        100
                    ]
                },
                {
                    "dtype": "float32",
                    "name": "dense_4/kernel",
                    "shape": [
                        100,
                        1
                    ]
                },
                {
                    "dtype": "float32",
                    "name": "dense_4/bias",
                    "shape": [
                        1
                    ]
                }
            ]
        }
    ]
}